[
  {
    "en_id": "5.2",
    "name_de": "Aktivierung von Barrierefreiheitsfunktionen",
    "description": "Where ICT has documented accessibility features, it shall be possible to activate those documented accessibility features that are required to meet a specific need without relying on a method that does not support that need.",
    "description_de": "Wenn für IKT Barrierefreiheitsfunktionen dokumentiert sind, muss es möglich sein, die für einen spezifischen Bedarf erforderlichen Funktionen zu aktivieren, ohne auf eine Methode angewiesen zu sein, die diesen Bedarf nicht unterstützt.",
    "name": "Activation of accessibility features",
    "chapter": "5",
    "chapterTitle": "Allgemeine Anforderungen"
  },
  {
    "en_id": "5.3",
    "name_de": "Biometrie",
    "description": "Where ICT uses biological characteristics, it shall not rely on the use of a particular biological characteristic as the only means of user identification or for control of ICT.",
    "description_de": "Wenn IKT biologische Merkmale nutzt, darf sie sich nicht allein auf ein bestimmtes biologisches Merkmal zur Benutzeridentifizierung oder zur Steuerung der IKT verlassen.",
    "name": "Biometrics",
    "chapter": "5",
    "chapterTitle": "Allgemeine Anforderungen"
  },
  {
    "en_id": "5.4",
    "name_de": "Erhaltung von Barrierefreiheitsinformationen bei Konvertierung",
    "description": "Where ICT converts information or communication it shall preserve all documented non-proprietary information that is provided for accessibility, to the extent that such information can be contained in or supported by the destination format.",
    "description_de": "Wenn IKT Informationen oder Kommunikation konvertiert, muss sie alle dokumentierten, nicht-proprietären Informationen für die Barrierefreiheit erhalten, soweit diese im Zielformat enthalten sein oder dort unterstützt werden können.",
    "name": "Preservation of accessibility information during conversion",
    "chapter": "5",
    "chapterTitle": "Allgemeine Anforderungen"
  },
  {
    "en_id": "BITV 2.0 §7 / BITV NRW §4",
    "name_de": "Erklärung zur Barrierefreiheit",
    "description_de": " Die öffentlichen Stellen des Landes stellen gemäß § 10b Absatz 1 des Behindertengleichstellungsgesetzes Nordrhein-Westfalen eine Erklärung über die Vereinbarkeit ihrer Website und mobilen Anwendung mit den technischen Anforderungen gemäß § 3 bereit.",
    "chapter": "5",
    "chapterTitle": "Allgemeine Anforderungen"
  },
  {
    "en_id": "BITV 2.0 §7 (2) / BITV NRW §5",
    "name_de": "Erklärung zur Barrierefreiheit",
    "description_de": "Das elektronische Kontaktformular (Feedback-Mechanismus) nach § 10b Absatz 2 Nummer 2 des Behindertengleichstellungsgesetzes Nordrhein-Westfalen ist in der Erklärung zur Barrierefreiheit nach § 4 zu beschreiben und zu verlinken.",
    "chapter": "5",
    "chapterTitle": "Allgemeine Anforderungen"
  },
  {
    "en_id": "6.1",
    "name_de": "Audiobandbreite für Sprache",
    "name": "Audio bandwidth for speech",
    "description": "ICT that provides two-way voice communication shall support encoding and decoding of voice with an upper frequency limit of at least 7000 Hz for good audio quality.",
    "description_de": "IKT, die Zwei-Wege-Sprachkommunikation bereitstellt, muss das Codieren und Decodieren von Sprache mit einer oberen Frequenzgrenze von mindestens 7000 Hz für gute Audioqualität unterstützen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.1.1",
    "name_de": "Textkommunikation in Echtzeit",
    "name": "RTT communication",
    "description": "ICT that supports two-way voice communication shall also support two-way Real-Time Text (RTT) communication, unless additional hardware would be required.",
    "description_de": "IKT, die Zwei-Wege-Sprachkommunikation unterstützt, muss zudem Zwei-Wege-Echtzeittext-Kommunikation (RTT) ermöglichen, es sei denn, hierfür wäre zusätzliche Hardware erforderlich.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.1.2",
    "name_de": "Gleichzeitige Sprache und Text",
    "name": "Concurrent voice and text",
    "description": "ICT shall allow simultaneous voice and Real-Time Text (RTT) communication through a single user connection.",
    "description_de": "IKT muss gleichzeitige Sprach- und Echtzeittextkommunikation (RTT) über eine einzige Benutzerverbindung ermöglichen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.2.1",
    "name_de": "Visuell unterscheidbare Anzeige von Textnachrichten",
    "name": "Visually distinguishable display",
    "description": "ICT shall visually distinguish sent RTT messages from received messages.",
    "description_de": "IKT muss gesendete RTT-Nachrichten visuell von empfangenen Nachrichten unterscheiden.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.2.2",
    "name_de": "Programmatisch unterscheidbare Anzeige von Textnachrichten",
    "name": "Programmatically determinable send and receive direction",
    "description": "ICT shall make it programmatically possible to determine whether RTT text is sent or received.",
    "description_de": "IKT muss programmgesteuert erkennen lassen, ob RTT-Text gesendet oder empfangen wird.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.2.3",
    "name_de": "Sprecheridentifizierung",
    "name": "Speaker identification",
    "description": "ICT with RTT capability shall also support speaker identification for RTT, as it does for voice.",
    "description_de": "IKT mit RTT-Funktionalität muss – wie bei Sprache – auch Sprecheridentifizierung für RTT unterstützen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.2.4",
    "name_de": "Echtzeitanzeige von Sprech-Aktivität",
    "name": "Visual indicator of audio with RTT",
    "description": "ICT shall provide a real-time visual indicator of audio activity when RTT is active.",
    "description_de": "Ist RTT aktiv, muss die IKT einen visuellen Indikator für Audioaktivität in Echtzeit bereitstellen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.3",
    "name_de": "Interoperabilität von Echtzeit-Textkommunikation",
    "name": "Interoperability",
    "description": "ICT with RTT functionality shall support standardized interoperability mechanisms appropriate to the communication network used.",
    "description_de": "IKT mit RTT-Funktionalität muss standardisierte Interoperabilitätsmechanismen unterstützen, die dem verwendeten Kommunikationsnetzwerk entsprechen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.2.4",
    "name_de": "Reaktionsgeschwindigkeit der Echtzeit-Textkommunikation",
    "name": "RTT responsiveness",
    "description": "RTT input shall be transmitted within 500 ms of the smallest reliably composed text unit being available for transmission.",
    "description_de": "RTT-Eingaben müssen innerhalb von 500 ms nach Verfügbarkeit der kleinsten zuverlässig zusammengesetzten Texteineinheit übertragen werden.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.3",
    "name_de": "Anrufer-Identifizierung",
    "name": "Caller ID",
    "description": "ICT shall provide caller identification and similar features in text form and programmatically determinable format, unless the function is closed.",
    "description_de": "IKT muss Anruferidentifizierung und vergleichbare Funktionen in Textform und in programmgesteuert auswertbarem Format bereitstellen, sofern diese Funktion nicht deaktiviert ist.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.4",
    "name_de": "Alternativen zu sprachbasierten Diensten",
    "name": "Alternatives to voice-based services",
    "description": "ICT providing voice-based services like voicemail or IVR must offer an alternative method to access these services without requiring hearing or speech.",
    "description_de": "IKT, die sprachbasierte Dienste wie Voicemail oder IVR anbietet, muss eine alternative Zugriffsmöglichkeit bereitstellen, die weder Hören noch Sprechen erfordert.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.1",
    "name_de": "Allgemeines (informativ)",
    "name": "General (informative)",
    "description": "Describes user needs for sign language and lip-reading in video communications, and typical performance requirements including resolution, frame rate, and synchronization.",
    "description_de": "Beschreibt die Bedürfnisse von Nutzenden in Bezug auf Gebärdensprache und Lippenlesen in der Videokommunikation sowie typische Leistungsanforderungen wie Auflösung, Bildrate und Synchronität.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.2",
    "name_de": "Auflösung bei Videotelefonie",
    "name": "Resolution",
    "description": "ICT with video functionality shall support at least QVGA resolution, and preferably VGA resolution, to support users of sign language and lip reading.",
    "description_de": "IKT mit Videofunktionalität muss mindestens QVGA-, vorzugsweise VGA-Auflösung unterstützen, um Nutzende von Gebärdensprache und Lippenlesen zu unterstützen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.3",
    "name_de": "Bildwiederholfrequenz bei Videotelefonie",
    "name": "Frame rate",
    "description": "ICT shall support a video frame rate of at least 20 FPS, preferably 30 FPS, to ensure usability for sign language and lip-reading users.",
    "description_de": "IKT muss eine Video-Bildrate von mindestens 20 FPS, vorzugsweise 30 FPS, unterstützen, um die Nutzbarkeit für Gebärdensprache- und Lippenlese-Nutzende sicherzustellen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.4",
    "name_de": "Synchronität bei Videotelefonie",
    "name": "Synchronization between audio and video",
    "description": "ICT shall ensure audio and video are synchronized with a maximum allowed delay of 100 ms between them.",
    "description_de": "IKT muss sicherstellen, dass Audio und Video mit einer maximal zulässigen Verzögerung von 100 ms synchronisiert sind.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.5",
    "name_de": "Visuelle Anzeige von Audio-Aktivität",
    "name": "Visual indicator of audio with video",
    "description": "ICT with video functionality shall provide a visual indicator of audio activity in real time.",
    "description_de": "IKT mit Videofunktionalität muss einen visuellen Indikator für Audioaktivität in Echtzeit bereitstellen.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.5.6",
    "name_de": "Sprecher-Anzeige für Gebärdensprachen-Kommunikation",
    "name": "Speaker identification with video (sign language) communication",
    "description": "ICT shall support speaker identification for users communicating via sign language during real-time video sessions.",
    "description_de": "IKT muss bei Echtzeit-Video-Sitzungen eine Sprecheridentifizierung für Nutzende ermöglichen, die mittels Gebärdensprache kommunizieren.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "6.6",
    "name_de": "Alternativen zu videobasierten Diensten",
    "name": "Alternatives to video-based services",
    "description": "ICT that provides video-based communication and related services (e.g., answering machines, IVR) should offer users alternatives accessible without hearing, speech, or vision.",
    "description_de": "IKT, die videobasierte Kommunikation und zugehörige Dienste (z. B. Anrufbeantworter, IVR) bereitstellt, sollte Alternativen anbieten, die ohne Hör-, Sprach- oder Sehvermögen zugänglich sind.",
    "chapter": "6",
    "chapterTitle": "Zwei-Wege-Sprachkommunikation"
  },
  {
    "en_id": "7.1.1",
    "name_de": "Wiedergabe von Untertiteln",
    "name": "Captioning playback",
    "description": "ICT that displays video with synchronized audio shall provide a mode to display captions, including allowing the user to enable closed captions where available.",
    "description_de": "IKT, die Video mit synchronisiertem Audio anzeigt, muss einen Modus zur Anzeige von Untertiteln bereitstellen, einschließlich der Möglichkeit, verfügbare geschlossene Untertitel zu aktivieren.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.1.2",
    "name_de": "Synchrone Untertitel",
    "name": "Captioning synchronization",
    "description": "ICT shall ensure synchronization of captions with audio: within 100 ms of timestamps for recorded content and within 100 ms of availability for live content.",
    "description_de": "IKT muss die Synchronisation der Untertitel mit dem Audio sicherstellen: innerhalb von 100 ms der Zeitstempel bei aufgezeichneten Inhalten und innerhalb von 100 ms nach Verfügbarkeit bei Live-Inhalten.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.1.3",
    "name_de": "Erhaltung von Untertiteln",
    "name": "Preservation of captioning",
    "description": "When ICT transmits, converts, or records video, it shall preserve caption data so it remains usable and synchronized according to playback requirements.",
    "description_de": "Wenn IKT Video überträgt, konvertiert oder aufzeichnet, muss sie Untertiteldaten so erhalten, dass sie nutzbar bleiben und entsprechend den Wiedergabeanforderungen synchronisiert sind.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.1.4",
    "name_de": "Untertitel-Anpassungen",
    "name": "Captions characteristics",
    "description": "ICT shall allow users to customize caption display (e.g. color, size, font), except when captions are unmodifiable (e.g. bitmap subtitles).",
    "description_de": "IKT muss es Nutzenden ermöglichen, die Darstellung von Untertiteln (z. B. Farbe, Größe, Schriftart) anzupassen, außer wenn Untertitel nicht veränderbar sind (z. B. Bitmap-Untertitel).",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.1.5",
    "name_de": "Gesprochene Untertitel",
    "name": "Spoken subtitles",
    "description": "ICT shall provide a mode to deliver spoken output of captions, unless the captions are not programmatically accessible (e.g. bitmap images).",
    "description_de": "IKT muss einen Modus anbieten, in dem Untertitel als gesprochene Ausgabe wiedergegeben werden, sofern die Untertitel programmgesteuert zugänglich sind (nicht z. B. als Bitmap-Bild).",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.2.1",
    "name_de": "Wiedergabe von Audiodeskription",
    "name": "Audio description playback",
    "description": "ICT shall enable selection and playback of available audio descriptions, either via dedicated tracks or alternative selection mechanisms.",
    "description_de": "IKT muss die Auswahl und Wiedergabe verfügbarer Audiodeskriptionen ermöglichen, entweder über dedizierte Tonspuren oder alternative Auswahlmechanismen.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.2.2",
    "name_de": "Synchrone Audiodeskription",
    "name": "Audio description synchronization",
    "description": "ICT shall ensure that audio descriptions are synchronized with the audio/visual content they describe.",
    "description_de": "IKT muss sicherstellen, dass Audiodeskriptionen mit dem beschriebenen Audio-/Videoinhalt synchronisiert sind.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.2.3",
    "name_de": "Erhaltung von Audiodeskription",
    "name": "Preservation of audio description",
    "description": "When ICT transmits, converts, or records video, it shall preserve audio description data in a way that maintains compatibility with playback requirements.",
    "description_de": "Wenn IKT Video überträgt, konvertiert oder aufzeichnet, muss sie die Daten der Audiodeskription so erhalten, dass die Kompatibilität mit den Wiedergabeanforderungen gewahrt bleibt.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "en_id": "7.3",
    "name_de": "Bedienelemente für Untertitel und Audiodeskription",
    "name": "User controls for captions and audio description",
    "description": "ICT that displays video with audio shall offer user controls to enable captions and audio descriptions at the same interaction level as the main media controls.",
    "description_de": "IKT, die Video mit Audio anzeigt, muss Bedienelemente bereitstellen, mit denen Untertitel und Audiodeskription auf derselben Interaktionsebene wie die Hauptmediensteuerungen aktiviert werden können.",
    "chapter": "7",
    "chapterTitle": "7 Videofähigkeiten"
  },
  {
    "wcag_id": "1.1.1",
    "en_id": "9.1.1",
    "name": "Non-text Content",
    "name_de": "Nicht-Text-Inhalt",
    "principle": "Perceivable",
    "level": "A",
    "description": "All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below.\n\nControls, Input: If non-text content is a control or accepts user input, then it has a name that describes its purpose.\nTime-Based Media: If non-text content is time-based media, then text alternatives at least provide descriptive identification of the non-text content.\nTest: If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text content.\nSensory: If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text content.\nCAPTCHA: If the purpose of non-text content is to confirm that content is being accessed by a person rather than a computer, then text alternatives that identify and describe the purpose of the non-text content are provided.\nDecoration, Formatting, Invisible: If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented in a way that it can be ignored by assistive technology.",
    "description_de": "Alle Nicht-Text-Inhalte, die dem Benutzer präsentiert werden, haben eine Textalternative, die einem äquivalenten Zweck dient, mit Ausnahme der folgenden Situationen:\n\n• Steuerelemente, Eingabe – Wenn Nicht-Text-Inhalt ein Steuerelement ist oder Benutzereingaben akzeptiert, hat er einen Namen, der seinen Zweck beschreibt.\n• Zeitbasierte Medien – Wenn Nicht-Text-Inhalt zeitbasierte Medien sind, liefern Textalternativen mindestens eine beschreibende Identifizierung des Inhalts.\n• Test – Wenn Nicht-Text-Inhalt ein Test oder eine Übung ist, die als Text ungültig wäre, liefern Textalternativen mindestens eine beschreibende Identifizierung.\n• Sensorisch – Wenn Nicht-Text-Inhalt hauptsächlich eine Sinneserfahrung erzeugen soll, liefern Textalternativen mindestens eine beschreibende Identifizierung.\n• CAPTCHA – Wenn Nicht-Text-Inhalt genutzt wird, um zu bestätigen, dass ein Mensch zugreift, werden Textalternativen bereitgestellt, die Zweck und Funktion beschreiben, sowie alternative CAPTCHA-Formen für unterschiedliche Wahrnehmungsarten.\n• Dekoration, Formatierung, unsichtbar – Wenn Nicht-Text-Inhalt reine Dekoration ist, nur zur visuellen Formatierung dient oder nicht angezeigt wird, ist er so implementiert, dass assistive Technologien ihn ignorieren können.",
    "chapter": "9.1.1",
    "chapterTitle": "Textalternativen"
  },
  {
    "wcag_id": "1.2.1",
    "en_id": "9.1.2.1",
    "name": "Audio-only and Video-only (Prerecorded)",
    "name_de": "Reine Audio- und Videoinhalte (aufgezeichnet)",
    "principle": "Perceivable",
    "level": "A",
    "description": "For prerecorded audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:\n\n• Prerecorded Audio-only: An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content.\n• Prerecorded Video-only: Either an alternative for time-based media or an audio track is provided that presents equivalent information for prerecorded video-only content.",
    "description_de": "Für aufgezeichnete reine Audio- und reine Videomedien gilt, außer wenn sie als Medienalternative für Text dienen und entsprechend gekennzeichnet sind:\n\n• Aufgezeichneter reiner Audioinhalt: Es wird eine Alternative für zeitbasierte Medien bereitgestellt, die äquivalente Informationen liefert.\n• Aufgezeichneter reiner Videoinhalt: Es wird entweder eine Alternative für zeitbasierte Medien oder eine Audiospur bereitgestellt, die äquivalente Informationen liefert.",
    "chapter": "9.1.2",
    "chapterTitle": "Zeitbasierte Medien"
  },
  {
    "wcag_id": "1.2.2",
    "en_id": "9.1.2.2",
    "name": "Captions (Prerecorded)",
    "name_de": "Untertitel (aufgezeichnet)",
    "principle": "Perceivable",
    "level": "A",
    "description": "Captions are provided for all prerecorded audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
    "description_de": "Für alle aufgezeichneten Audioinhalte in synchronisierten Medien werden Untertitel bereitgestellt, außer wenn die Medien als Alternative für Text dienen und entsprechend gekennzeichnet sind.",
    "chapter": "9.1.2",
    "chapterTitle": "Zeitbasierte Medien"
  },
  {
    "wcag_id": "1.2.3",
    "en_id": "9.1.2.3",
    "name": "Audio Description or Media Alternative (Prerecorded)",
    "name_de": "Audiodeskription oder Medienalternative (aufgezeichnet)",
    "principle": "Perceivable",
    "level": "A",
    "description": "An alternative for time-based media or audio description of the prerecorded video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
    "description_de": "Für synchronisierte Medien wird eine Alternative für zeitbasierte Medien oder eine Audiodeskription des aufgezeichneten Videoinhalts bereitgestellt, außer wenn die Medien als Alternative für Text dienen und entsprechend gekennzeichnet sind.",
    "chapter": "9.1.2",
    "chapterTitle": "Zeitbasierte Medien"
  },
  {
    "wcag_id": "1.2.4",
    "en_id": "9.1.2.4",
    "name": "Captions (Live)",
    "name_de": "Untertitel (Live)",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Captions are provided for all live audio content in synchronized media.",
    "description_de": "Für alle Live-Audioinhalte in synchronisierten Medien werden Untertitel bereitgestellt.",
    "chapter": "9.1.2",
    "chapterTitle": "Zeitbasierte Medien"
  },
  {
    "wcag_id": "1.2.5",
    "en_id": "9.1.2.5",
    "name": "Audio Description (Prerecorded)",
    "name_de": "Audiodeskription (aufgezeichnet)",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Audio description is provided for all prerecorded video content in synchronized media.",
    "description_de": "Für alle aufgezeichneten Videoinhalte in synchronisierten Medien wird eine Audiodeskription bereitgestellt.",
    "chapter": "9.1.2",
    "chapterTitle": "Zeitbasierte Medien"
  },
  {
    "wcag_id": "1.3.1",
    "en_id": "9.1.3.1",
    "name": "Info and Relationships",
    "name_de": "Info und Beziehungen",
    "principle": "Perceivable",
    "level": "A",
    "description": "Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text.",
    "description_de": "Informationen, Struktur und Beziehungen, die durch die Darstellung vermittelt werden, können programmgesteuert bestimmt oder als Text bereitgestellt werden.",
    "chapter": "9.1.3",
    "chapterTitle": "Anpassbar"
  },
  {
    "wcag_id": "1.3.2",
    "en_id": "9.1.3.2",
    "name": "Meaningful Sequence",
    "name_de": "Bedeutungstragende Reihenfolge",
    "principle": "Perceivable",
    "level": "A",
    "description": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined.",
    "description_de": "Wenn die Darstellungsreihenfolge die Bedeutung beeinflusst, kann die richtige Leseabfolge programmgesteuert bestimmt werden.",
    "chapter": "9.1.3",
    "chapterTitle": "Anpassbar"
  },
  {
    "wcag_id": "1.3.3",
    "en_id": "9.1.3.3",
    "name": "Sensory Characteristics",
    "name_de": "Sensorische Eigenschaften",
    "principle": "Perceivable",
    "level": "A",
    "description": "Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, color, size, visual location, orientation, or sound.",
    "description_de": "Anleitungen zum Verständnis und zur Bedienung des Inhalts stützen sich nicht ausschließlich auf sensorische Eigenschaften wie Form, Farbe, Größe, visuelle Position, Ausrichtung oder Ton.",
    "chapter": "9.1.3",
    "chapterTitle": "Anpassbar"
  },
  {
    "wcag_id": "1.3.4",
    "en_id": "9.1.3.4",
    "name": "Orientation",
    "name_de": "Bildschirmausrichtung",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential.",
    "description_de": "Die Darstellung und Bedienung von Inhalten ist nicht auf eine einzige Bildschirmausrichtung wie Hoch- oder Querformat beschränkt, es sei denn, sie ist unentbehrlich.",
    "chapter": "9.1.3",
    "chapterTitle": "Anpassbar"
  },
  {
    "wcag_id": "1.3.5",
    "en_id": "9.1.3.5",
    "name": "Identify Input Purpose",
    "name_de": "Bestimmung des Eingabezwecks",
    "principle": "Perceivable",
    "level": "AA",
    "description": "The purpose of each input field collecting information about the user can be programmatically determined when the input field serves a purpose identified in the Input Purposes for user interface components section.",
    "description_de": "Der Zweck jedes Eingabefelds für Benutzerdaten kann programmgesteuert bestimmt werden, wenn er im Abschnitt „Eingabezwecke für Bestandteile der Benutzerschnittstelle“ definiert ist.",
    "chapter": "9.1.3",
    "chapterTitle": "Anpassbar"
  },
  {
    "wcag_id": "1.4.1",
    "en_id": "9.1.4.1",
    "name": "Use of Color",
    "name_de": "Benutzung von Farbe",
    "principle": "Perceivable",
    "level": "A",
    "description": "Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.",
    "description_de": "Farbe wird nicht als alleiniges visuelles Mittel zur Informationsvermittlung, Aktionserkennung oder Unterscheidung von Elementen genutzt.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.2",
    "en_id": "9.1.4.2",
    "name": "Audio Control",
    "name_de": "Audio-Steuerelement",
    "principle": "Perceivable",
    "level": "A",
    "description": "If any audio on a web page plays automatically for more than 3 seconds, a mechanism is available to pause or stop the audio, or to control audio volume independently from the overall system volume level.",
    "description_de": "Wenn Audio automatisch länger als 3 Sekunden abgespielt wird, muss ein Mechanismus vorhanden sein, um das Audio zu pausieren, zu beenden oder die Lautstärke unabhängig von der Systemlautstärke zu regeln.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.3",
    "en_id": "9.1.4.3",
    "name": "Contrast (Minimum)",
    "name_de": "Kontrast (Minimum)",
    "principle": "Perceivable",
    "level": "AA",
    "description": "The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for large text (3:1), incidental text, and logotypes.",
    "description_de": "Text und Textbilder müssen ein Kontrastverhältnis von mindestens 4,5:1 haben (großer Text 3:1), ausgenommen nebensächlicher Text und Logos.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.4",
    "en_id": "9.1.4.4",
    "name": "Resize Text",
    "name_de": "Textgröße ändern",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality.",
    "description_de": "Mit Ausnahme von Untertiteln und Textbildern kann Text ohne Hilfstechnologien bis zu 200 % vergrößert werden, ohne dass Inhalte oder Funktionen verloren gehen.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.5",
    "en_id": "9.1.4.5",
    "name": "Images of Text",
    "name_de": "Bilder eines Textes",
    "principle": "Perceivable",
    "level": "AA",
    "description": "If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except when the image of text is essential or can be customized.",
    "description_de": "Wenn die eingesetzte Technik die visuelle Darstellung unterstützt, wird Text statt eines Textbildes verwendet, außer das Bild ist unentbehrlich oder kann angepasst werden.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.10",
    "en_id": "9.1.4.10",
    "name": "Reflow",
    "name_de": "Umfluss (Reflow)",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Content can be presented without loss of information or functionality and without two-dimensional scrolling for viewport widths of 320 CSS pixels (vertical scrolling) and heights of 256 CSS pixels (horizontal scrolling), unless two-dimensional layout is essential.",
    "description_de": "Inhalte können ohne Informations- bzw. Funktionsverlust und ohne zweidimensionales Scrollen bei 320 CSS-Pixel Breite (vertikal) bzw. 256 CSS-Pixel Höhe (horizontal) dargestellt werden, außer ein zweidimensionales Layout ist unentbehrlich.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.11",
    "en_id": "9.1.4.11",
    "name": "Non-text Contrast",
    "name_de": "Nicht-Text-Kontrast",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Visual information required to identify UI components and graphical objects has a contrast ratio of at least 3:1 against adjacent colors.",
    "description_de": "Visuelle Informationen, die zur Identifizierung von UI-Bestandteilen und Grafiken erforderlich sind, müssen ein Kontrastverhältnis von mindestens 3:1 zu angrenzenden Farben haben.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.12",
    "en_id": "9.1.4.12",
    "name": "Text Spacing",
    "name_de": "Textabstand",
    "principle": "Perceivable",
    "level": "AA",
    "description": "No loss of content or functionality occurs by setting line height ≥1.5× font size, paragraph spacing ≥2× font size, letter spacing ≥0.12× font size, and word spacing ≥0.16× font size.",
    "description_de": "Kein Inhalts- oder Funktionsverlust bei Zeilenhöhe ≥ 1,5×, Absatzabstand ≥ 2×, Buchstabenabstand ≥ 0,12× und Wortabstand ≥ 0,16× der Schriftgröße.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "1.4.13",
    "en_id": "9.1.4.13",
    "name": "Content on Hover or Focus",
    "name_de": "Inhalt bei Hover oder Fokus",
    "principle": "Perceivable",
    "level": "AA",
    "description": "Additional content triggered by hover or focus is dismissible, hoverable, and remains visible until dismissed or no longer valid.",
    "description_de": "Zusätzliche Inhalte, die bei Hover oder Fokus erscheinen, müssen verwerfbar, mit dem Zeiger erreichbar und so lange sichtbar sein, bis sie verworfen oder ungültig werden.",
    "chapter": "9.1.4",
    "chapterTitle": "Unterscheidbar"
  },
  {
    "wcag_id": "2.1.1",
    "en_id": "9.2.1.1",
    "name": "Keyboard",
    "name_de": "Tastatur",
    "principle": "Operable",
    "level": "A",
    "description": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes.",
    "description_de": "Alle Funktionen müssen über eine Tastaturschnittstelle bedienbar sein, ohne dass bestimmte Zeitabstände für einzelne Tastenanschläge erforderlich sind.",
    "chapter": "9.2.1",
    "chapterTitle": "Per Tastatur zugänglich"
  },
  {
    "wcag_id": "2.1.2",
    "en_id": "9.2.1.2",
    "name": "No Keyboard Trap",
    "name_de": "Keine Tastaturfalle",
    "principle": "Operable",
    "level": "A",
    "description": "If keyboard focus can be moved to a component, focus can be moved away using only the keyboard, and if more than standard keys are required, the method is documented.",
    "description_de": "Wenn der Tastaturfokus auf ein Element gesetzt werden kann, muss er sich auch ausschließlich mit der Tastatur wieder entfernen lassen; sind dafür Spezialtasten nötig, muss die Methode dokumentiert sein.",
    "chapter": "9.2.1",
    "chapterTitle": "Per Tastatur zugänglich"
  },
  {
    "wcag_id": "2.1.4",
    "en_id": "9.2.1.4",
    "name": "Character Key Shortcuts",
    "name_de": "Zeichentastenbefehle",
    "principle": "Operable",
    "level": "A",
    "description": "If a keyboard shortcut uses only printable characters, at least one of the following is true: it can be turned off; remapped to include non-printable keys; or active only on focus.",
    "description_de": "Verwendet ein Tastenkürzel nur druckbare Zeichen, muss es deaktivierbar, auf nicht druckbare Tasten umlegbar oder nur bei Fokus aktiv sein.",
    "chapter": "9.2.1",
    "chapterTitle": "Per Tastatur zugänglich"
  },
  {
    "wcag_id": "2.2.1",
    "en_id": "9.2.2.1",
    "name": "Timing Adjustable",
    "name_de": "Zeiteinteilung anpassbar",
    "principle": "Operable",
    "level": "A",
    "description": "For each time limit set by the content, users can turn it off, adjust it over a wide range, extend it with warning, unless essential or real-time.",
    "description_de": "Für jede zeitliche Begrenzung muss der Nutzer sie abschalten, weitgehend anpassen oder nach Warnung verlängern können, sofern sie nicht wesentlich oder Echtzeit-bedingt ist.",
    "chapter": "9.2.2",
    "chapterTitle": "Ausreichend Zeit"
  },
  {
    "wcag_id": "2.2.2",
    "en_id": "9.2.2.2",
    "name": "Pause, Stop, Hide",
    "name_de": "Pausieren, beenden, ausblenden",
    "principle": "Operable",
    "level": "A",
    "description": "Moving, blinking, scrolling, or auto-updating information that starts automatically and lasts more than 5 seconds has a mechanism to pause, stop, or hide it.",
    "description_de": "Sich bewegende, blinkende, scrollende oder automatisch aktualisierte Inhalte, die automatisch starten und länger als fünf Sekunden dauern, müssen pausier-, beend- oder ausblendbar sein.",
    "chapter": "9.2.2",
    "chapterTitle": "Ausreichend Zeit"
  },
  {
    "wcag_id": "2.3.1",
    "en_id": "9.2.3.1",
    "name": "Three Flashes or Below Threshold",
    "name_de": "Grenzwert von dreimaligem Blitzen oder weniger",
    "principle": "Operable",
    "level": "A",
    "description": "Web pages do not contain anything that flashes more than three times in any one-second period, or the flash is below the general and red flash thresholds.",
    "description_de": "Webseiten dürfen nichts enthalten, das öfter als dreimal pro Sekunde blinkt; andernfalls muss das Blinken unter den allgemeinen und roten Schwellenwerten liegen.",
    "chapter": "9.2.3",
    "chapterTitle": "Anfälle"
  },
  {
    "wcag_id": "2.4.1",
    "en_id": "9.2.4.1",
    "name": "Bypass Blocks",
    "name_de": "Blöcke umgehen",
    "principle": "Operable",
    "level": "A",
    "description": "A mechanism is available to bypass blocks of content that are repeated on multiple pages.",
    "description_de": "Es muss einen Mechanismus geben, um wiederholte Inhaltsblöcke zu überspringen.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.2",
    "en_id": "9.2.4.2",
    "name": "Page Titled",
    "name_de": "Seite mit Titel versehen",
    "principle": "Operable",
    "level": "A",
    "description": "Web pages have titles that describe topic or purpose.",
    "description_de": "Webseiten müssen Titel haben, die Thema oder Zweck beschreiben.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.3",
    "en_id": "9.2.4.3",
    "name": "Focus Order",
    "name_de": "Fokus-Reihenfolge",
    "principle": "Operable",
    "level": "A",
    "description": "If sequential navigation affects meaning or operation, focusable components receive focus in an order that preserves meaning and operability.",
    "description_de": "Wenn die Navigationsreihenfolge Bedeutung oder Bedienung beeinflusst, müssen fokussierbare Elemente in einer Reihenfolge fokussiert werden, die Bedeutung und Bedienbarkeit erhält.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.4",
    "en_id": "9.2.4.4",
    "name": "Link Purpose (In Context)",
    "name_de": "Linkzweck (im Kontext)",
    "principle": "Operable",
    "level": "A",
    "description": "The purpose of each link can be determined from the link text alone or with programmatically determined context.",
    "description_de": "Der Zweck jedes Links muss aus dem Linktext allein oder zusammen mit programmgesteuert ermitteltem Kontext hervorgehen.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.5",
    "en_id": "9.2.4.5",
    "name": "Multiple Ways",
    "name_de": "Verschiedene Methoden",
    "principle": "Operable",
    "level": "AA",
    "description": "More than one way is available to locate a page within a set of pages, except when the page is the result of or step in a process.",
    "description_de": "Es muss mehr als eine Möglichkeit geben, eine Seite innerhalb einer Reihe von Seiten zu finden, außer die Seite ist Ergebnis oder Schritt eines Prozesses.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.6",
    "en_id": "9.2.4.6",
    "name": "Headings and Labels",
    "name_de": "Überschriften und Beschriftungen",
    "principle": "Operable",
    "level": "AA",
    "description": "Headings and labels describe topic or purpose.",
    "description_de": "Überschriften und Labels müssen Thema oder Zweck beschreiben.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.4.7",
    "en_id": "9.2.4.7",
    "name": "Focus Visible",
    "name_de": "Fokus sichtbar",
    "principle": "Operable",
    "level": "AA",
    "description": "Any keyboard-operable UI has a mode where the keyboard focus indicator is visible.",
    "description_de": "Jede per Tastatur bedienbare Benutzeroberfläche muss einen Modus haben, in dem der Tastaturfokus sichtbar ist.",
    "chapter": "9.2.4",
    "chapterTitle": "Navigierbar"
  },
  {
    "wcag_id": "2.5.1",
    "en_id": "9.2.5.1",
    "name": "Pointer Gestures",
    "name_de": "Zeigergesten",
    "principle": "Operable",
    "level": "A",
    "description": "All functionality that uses multipoint or path-based gestures can be operated with a single pointer without a path-based gesture, unless essential.",
    "description_de": "Alle Funktionen, die Mehrpunkt- oder Pfadgesten nutzen, müssen mit einem einzelnen Zeiger ohne Pfadgeste bedienbar sein, sofern nicht unentbehrlich.",
    "chapter": "9.2.5",
    "chapterTitle": "Eingabemodalitäten"
  },
  {
    "wcag_id": "2.5.2",
    "en_id": "9.2.5.2",
    "name": "Pointer Cancellation",
    "name_de": "Zeigeraufhebung",
    "principle": "Operable",
    "level": "A",
    "description": "For single-pointer functionality, the down-event is not used to execute the function, or completion is on up-event with abort/undo, or up-event reverses outcome, unless essential.",
    "description_de": "Bei Ein-Zeiger-Funktionen darf das Down-Event nicht die Funktion ausführen, oder der Abschluss erfolgt mit dem Up-Event (mit Abbrechen/Rückgängig) bzw. das Up-Event macht das Ergebnis rückgängig – außer dies ist unentbehrlich.",
    "chapter": "9.2.5",
    "chapterTitle": "Eingabemodalitäten"
  },
  {
    "wcag_id": "2.5.3",
    "en_id": "9.2.5.3",
    "name": "Label in Name",
    "name_de": "Beschriftung im Namen",
    "principle": "Operable",
    "level": "A",
    "description": "For UI components with labels, the name contains the text that is presented visually.",
    "description_de": "Bei UI-Komponenten mit Beschriftung muss der programmatische Name den sichtbaren Text enthalten.",
    "chapter": "9.2.5",
    "chapterTitle": "Eingabemodalitäten"
  },
  {
    "wcag_id": "2.5.4",
    "en_id": "9.2.5.4",
    "name": "Motion Actuation",
    "name_de": "Auslösen durch Bewegung",
    "principle": "Operable",
    "level": "A",
    "description": "Functionality operable by device or user motion can also be operated by UI components, and motion-based actuation can be disabled, unless essential.",
    "description_de": "Funktionen, die mittels Geräte- oder Nutzerbewegung bedient werden, müssen auch über UI-Komponenten bedienbar und die Bewegungssteuerung deaktivierbar sein, sofern nicht unentbehrlich.",
    "chapter": "9.2.5",
    "chapterTitle": "Eingabemodalitäten"
  },
  {
    "wcag_id": "3.1.1",
    "en_id": "9.3.1.1",
    "name": "Language of Page",
    "name_de": "Sprache der Seite",
    "principle": "Understandable",
    "level": "A",
    "description": "The default human language of each web page can be programmatically determined.",
    "description_de": "Die Standardsprache jeder Webseite muss programmgesteuert bestimmbar sein.",
    "chapter": "9.3.1",
    "chapterTitle": "Lesbar"
  },
  {
    "wcag_id": "3.1.2",
    "en_id": "9.3.1.2",
    "name": "Language of Parts",
    "name_de": "Sprache von Teilen",
    "principle": "Understandable",
    "level": "AA",
    "description": "The human language of each passage or phrase in the content can be programmatically determined, except for proper names, technical terms, words of indeterminate language, and words or phrases that have become part of the vernacular.",
    "description_de": "Die Sprache jedes Textteils muss programmgesteuert bestimmbar sein, außer bei Eigennamen, Fachbegriffen, unbestimmter Sprache oder eingedeutschten Wörtern.",
    "chapter": "9.3.1",
    "chapterTitle": "Lesbar"
  },
  {
    "wcag_id": "3.2.1",
    "en_id": "9.3.2.1",
    "name": "On Focus",
    "name_de": "Bei Fokus",
    "principle": "Understandable",
    "level": "A",
    "description": "When any UI component receives focus, it does not initiate a change of context.",
    "description_de": "Wenn ein UI-Element den Fokus erhält, darf dies keine Kontextänderung auslösen.",
    "chapter": "9.3.2",
    "chapterTitle": "Vorhersehbar"
  },
  {
    "wcag_id": "3.2.2",
    "en_id": "9.3.2.2",
    "name": "On Input",
    "name_de": "Bei Eingabe",
    "principle": "Understandable",
    "level": "A",
    "description": "Changing the setting of any UI component does not automatically cause a change of context unless the user has been advised of the behavior.",
    "description_de": "Das Ändern einer Einstellung darf keinen automatischen Kontextwechsel verursachen, außer der Nutzer wurde darauf hingewiesen.",
    "chapter": "9.3.2",
    "chapterTitle": "Vorhersehbar"
  },
  {
    "wcag_id": "3.2.3",
    "en_id": "9.3.2.3",
    "name": "Consistent Navigation",
    "name_de": "Konsistente Navigation",
    "principle": "Understandable",
    "level": "AA",
    "description": "Navigational mechanisms repeated on multiple pages occur in the same relative order each time.",
    "description_de": "Wiederkehrende Navigationsmechanismen müssen stets in derselben relativen Reihenfolge auftreten.",
    "chapter": "9.3.2",
    "chapterTitle": "Vorhersehbar"
  },
  {
    "wcag_id": "3.2.4",
    "en_id": "9.3.2.4",
    "name": "Consistent Identification",
    "name_de": "Konsistente Erkennung",
    "principle": "Understandable",
    "level": "AA",
    "description": "Components with the same functionality within a set of pages are identified consistently.",
    "description_de": "Komponenten mit gleicher Funktion müssen innerhalb einer Seite oder eines Seitensets konsistent bezeichnet werden.",
    "chapter": "9.3.2",
    "chapterTitle": "Vorhersehbar"
  },
  {
    "wcag_id": "3.3.1",
    "en_id": "9.3.3.1",
    "name": "Error Identification",
    "name_de": "Fehlererkennung",
    "principle": "Understandable",
    "level": "A",
    "description": "If an input error is detected, the item in error is identified and the error described to the user in text.",
    "description_de": "Wird ein Eingabefehler erkannt, muss die fehlerhafte Eingabe markiert und der Fehler textlich beschrieben werden.",
    "chapter": "9.3.3",
    "chapterTitle": "Hilfestellung bei der Eingabe"
  },
  {
    "wcag_id": "3.3.2",
    "en_id": "9.3.3.2",
    "name": "Labels or Instructions",
    "name_de": "Beschriftungen oder Anweisungen",
    "principle": "Understandable",
    "level": "A",
    "description": "Labels or instructions are provided when content requires user input.",
    "description_de": "Wenn Benutzereingaben erforderlich sind, müssen Beschriftungen oder Anweisungen bereitgestellt werden.",
    "chapter": "9.3.3",
    "chapterTitle": "Hilfestellung bei der Eingabe"
  },
  {
    "wcag_id": "3.3.3",
    "en_id": "9.3.3.3",
    "name": "Error Suggestion",
    "name_de": "Fehlerempfehlung",
    "principle": "Understandable",
    "level": "AA",
    "description": "If an input error is detected and suggestions for correction are known, then the suggestions are provided to the user.",
    "description_de": "Sind Korrekturmöglichkeiten für einen Eingabefehler bekannt, müssen sie dem Nutzer angeboten werden.",
    "chapter": "9.3.3",
    "chapterTitle": "Hilfestellung bei der Eingabe"
  },
  {
    "wcag_id": "3.3.4",
    "en_id": "9.3.3.4",
    "name": "Error Prevention (Legal, Financial, Data)",
    "name_de": "Fehlervermeidung (rechtlich, finanziell, Daten)",
    "principle": "Understandable",
    "level": "AA",
    "description": "For pages that cause legal commitments, financial transactions, or data changes, at least one of: reversible, checked, or confirmed submissions.",
    "description_de": "Bei Aktionen mit rechtlichen, finanziellen oder datenverändernden Folgen muss mindestens eine der Optionen möglich sein: rückgängig machen, prüfen oder bestätigen.",
    "chapter": "9.3.3",
    "chapterTitle": "Hilfestellung bei der Eingabe"
  },
  {
    "wcag_id": "4.1.1",
    "en_id": "9.4.1.1",
    "name": "Parsing",
    "name_de": "Syntaxanalyse",
    "principle": "Robust",
    "level": "A",
    "description": "In content implemented using markup languages, elements have complete start and end tags, are nested correctly, have no duplicate attributes, and any IDs are unique.",
    "description_de": "In Markup-Sprachen müssen Elemente vollständige Start- und End-Tags besitzen, korrekt verschachtelt sein, keine doppelten Attribute haben und eindeutige IDs aufweisen.",
    "chapter": "9.4.1",
    "chapterTitle": "Kompatibel"
  },
  {
    "wcag_id": "4.1.2",
    "en_id": "9.4.1.2",
    "name": "Name, Role, Value",
    "name_de": "Name, Rolle, Wert",
    "principle": "Robust",
    "level": "A",
    "description": "For all UI components, the name and role can be programmatically determined; states, properties, and values can be set programmatically; and changes are available to assistive technologies.",
    "description_de": "Für alle UI-Komponenten müssen Name und Rolle programmgesteuert bestimmbar sein; Zustände, Eigenschaften und Werte müssen programmgesteuert gesetzt werden können und Änderungen assistiven Technologien verfügbar sein.",
    "chapter": "9.4.1",
    "chapterTitle": "Kompatibel"
  },
  {
    "wcag_id": "4.1.3",
    "en_id": "9.4.1.3",
    "name": "Status Messages",
    "name_de": "Statusmeldungen",
    "principle": "Robust",
    "level": "AA",
    "description": "In content implemented using markup languages, status messages can be programmatically determined through role or properties without receiving focus.",
    "description_de": "In Markup-Inhalten müssen Statusmeldungen über Rolle oder Eigenschaften programmgesteuert erkennbar sein, ohne dass sie Fokus erhalten.",
    "chapter": "9.4.1",
    "chapterTitle": "Kompatibel"
  },
  {
    "en_id": "11.7",
    "name": "User Preferences",
    "name_de": "Benutzerdefinierte Einstellungen",
    "description": "Where software is not designed to be isolated from its platform, and provides a user interface, that user interface shall follow the values of the user preferences for platform settings for: units of measurement, colour, contrast, font type, font size, and focus cursor except where they are overridden by the user.",
    "description_de": "Wenn Software nicht von ihrer Plattform isoliert ist und eine Benutzeroberfläche bereitstellt, muss diese die Benutzereinstellungen der Plattform für Maßeinheiten, Farbe, Kontrast, Schriftart, Schriftgröße und Fokus-Cursor übernehmen, sofern sie nicht vom Benutzer überschrieben werden.",
    "chapter": "11.7",
    "chapterTitle": "Benutzerdefinierte Einstellungen"
  },
  {
    "en_id": "11.8.2",
    "name": "Accessible content creation",
    "name_de": "Barrierefreie Erstellung von Inhalten",
    "description": "Authoring tools shall enable and guide the production of content that conforms to clauses 9 (Web content) or 10 (Non-Web content) as applicable.",
    "description_de": "Autorenwerkzeuge müssen die Erstellung von Inhalten ermöglichen und anleiten, die den Anforderungen von Klausel 9 (Web-Inhalte) bzw. Klausel 10 (Nicht-Web-Inhalte) entsprechen.",
    "chapter": "11.8",
    "chapterTitle": "Autorenwerkzeuge"
  },
  {
    "en_id": "11.8.3",
    "name": "Preservation of accessibility information in transformations",
    "name_de": "Erhaltung von Barrierefreiheitsinformationen bei Transformation",
    "description": "If the authoring tool provides restructuring transformations or re-coding transformations, then accessibility information shall be preserved in the output if equivalent mechanisms exist in the content technology of the output.",
    "description_de": "Bietet ein Autorenwerkzeug Umstrukturierungs- oder Neukodierungs-Transformationen an, müssen Barrierefreiheitsinformationen im Ergebnis erhalten bleiben, sofern in der Zieltechnologie gleichwertige Mechanismen vorhanden sind.",
    "chapter": "11.8",
    "chapterTitle": "Autorenwerkzeuge"
  },
  {
    "en_id": "11.8.4",
    "name": "Repair assistance",
    "name_de": "Reparaturassistenz",
    "description": "If the accessibility checking functionality of an authoring tool can detect that content does not meet a requirement of clauses 9 (Web) or 10 (Non-web documents) as applicable, then the authoring tool shall provide repair suggestion(s).",
    "description_de": "Kann die Barrierefreiheitsprüfung eines Autorenwerkzeugs erkennen, dass Inhalte eine Anforderung der Klauseln 9 (Web) oder 10 (Nicht-Web-Dokumente) nicht erfüllen, muss das Werkzeug Reparaturvorschläge anbieten.",
    "chapter": "11.8",
    "chapterTitle": "Autorenwerkzeuge"
  },
  {
    "en_id": "11.8.5",
    "name": "Templates",
    "name_de": "Vorlagen",
    "description": "When an authoring tool provides templates, at least one template that supports the creation of content that conforms to the requirements of clauses 9 (Web) or 10 (Non-web documents) as applicable shall be available and identified as such.",
    "description_de": "Stellt ein Autorenwerkzeug Vorlagen bereit, muss mindestens eine Vorlage verfügbar und als solche gekennzeichnet sein, die die Erstellung konformer Inhalte nach Klausel 9 (Web) oder 10 (Nicht-Web-Dokumente) unterstützt.",
    "chapter": "11.8",
    "chapterTitle": "Autorenwerkzeuge"
  },
  {
    "en_id": "12.1.1",
    "name": "Accessibility and compatibility features",
    "name_de": "Dokumentation von Kompatibilität und Barrierefreiheit",
    "description": "Product documentation provided with the ICT whether provided separately or integrated within the ICT shall list and explain how to use the accessibility and compatibility features of the ICT.",
    "description_de": "Die mit der IKT bereitgestellte Produktdokumentation – separat oder integriert – muss auflisten und erklären, wie die Barrierefreiheits- und Kompatibilitätsfunktionen genutzt werden.",
    "chapter": "12",
    "chapterTitle": "Dokumentation und Support"
  },
  {
    "en_id": "12.1.2",
    "name": "Accessible documentation",
    "name_de": "Barrierefreie Dokumentation",
    "description": "Product documentation provided with the ICT shall be made available in at least one of the following electronicformats: a) a Web format that conforms to the requirements of clause 9; or b) a non-web format that conforms to the requirements of clause 10.",
    "description_de": "Die Produktdokumentation muss in mindestens einem der folgenden Formate verfügbar sein: a) Web-Format gemäß Klausel 9 oder b) Nicht-Web-Format gemäß Klausel 10.",
    "chapter": "12",
    "chapterTitle": "Dokumentation und Support"
  },
  {
    "en_id": "12.2.2",
    "name": "Information on accessibility and compatibility features",
    "name_de": "Technischer Support",
    "description": "ICT support services shall provide information on the accessibility and compatibility features that are mentioned in the product documentation.",
    "description_de": "Der IKT-Support muss Informationen zu den in der Produktdokumentation genannten Barrierefreiheits- und Kompatibilitätsfunktionen bereitstellen.",
    "chapter": "12",
    "chapterTitle": "Dokumentation und Support"
  },
  {
    "en_id": "12.2.3",
    "name": "Effective communication",
    "name_de": "Effektive Kommunikation",
    "description": "ICT support services shall accommodate the communication needs of individuals with disabilities either directly or through a referral point.",
    "description_de": "Der IKT-Support muss die Kommunikationsbedürfnisse von Menschen mit Behinderungen direkt oder über eine Vermittlungsstelle berücksichtigen.",
    "chapter": "12",
    "chapterTitle": "Dokumentation und Support"
  },
  {
    "en_id": "12.2.4",
    "name": "Accessible documentation",
    "name_de": "Vom Support bereitgestellte Dokumentation",
    "description": "Documentation provided by support services shall be made available in at least one of the following electronic formats: a) a Web format that conforms to clause 9; or b) a non-web format that conforms to clause 10.",
    "description_de": "Vom Support bereitgestellte Dokumentation muss in mindestens einem der folgenden Formate verfügbar sein: a) Web-Format gemäß Klausel 9 oder b) Nicht-Web-Format gemäß Klausel 10.",
    "chapter": "12",
    "chapterTitle": "Dokumentation und Support"
  }
]
